app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    # binding.pry
    @items = Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_item
    @item = Item.find(params[:id])